#ifndef _SETTINGS_TNKBP_H_
#define _SETTINGS_TNKBP_H_
static setting_t tnkbp_Settings[] = {
	{"Частота вращения",0.0, 0x257,1},
	{"Защита по перегрузу",0.0, 0x232,1},
	{"Время блокировки защиты по перегрузке",0.0, 0x233,1},
	{"Время блокировки АПВ по перегрузке",0.0, 0x235,1},
	{"Количество перезапусков",0.0, 0x251,1},
	{"Время,  в течение которого разрешены перезапуски",0.0,0x234,1},
	{"Защита по недогрузу",0.0, 0x237,1},
	{"Время блокировки защиты по недогрузу",0.0, 0x238,1},
	{"Время блокировки АПВ по недогрузу",0.0, 0x23A,1},
	{"Куст",0.0, 0x272,1},
	{"Скважина",0.0, 0x273,1},
	{"Пароль",0.0, 0x27D,1},
	{"Служебный режим",0.0, 0x27E,1},
	{"Время (часы, минуты)",0.0,0x27C,1},
	{"Дата (число, месяц)",0.0,0x27B,1},
	{"Год",0.0, 0x27A,1},
	{"Напряжение вторичной обмотки трансформатора",0.0, 0x230,1},
	{"Время блокировки запуска после включения питания",0.0, 0x22D,1},
	{"Защита по Rиз",0.0, 0x240,1},
	{"Дисбаланс по U вх.   лин.",0.0, 0x22A,1},
	{"Время срабатывания защиты по дисбалансу U вх.  лин.",0.0, 0x22B,1},
	{"Дисбаланс по  I  вых. фаз.",0.0, 0x23C,1},
	{"Время срабатывания защиты по дисбалансу I  вых. фаз",0.0, 0x23D,1},
	{"Предельная температура ВД ",0.0, 0x24B,1},
	{"Давление жидкости на приеме насоса",0.0, 0x247,1},
};
#define NUMBER_OF_SETTINGS_TNKBP (sizeof(tnkbp_Settings) / sizeof(setting_t))
#endif
