#ifndef _SETTINGS_LUKOIL_H_
#define _SETTINGS_LUKOIL_H_
static setting_t lukoil_Settings[] = {
	{"Частота вращения",0.0, 0x039B,1},
	{"Защита по перегрузу",0.0, 0x311,1},
	{"Время блокировки защиты по перегрузке",0.0, 0x312,1},
	{"Время блокировки АПВ по перегрузке",0.0, 0x313,1},
	{"Количество перезапусков",0.0, 0x314,1},
	{"Время,  в течение которого разрешены перезапуски",0.0,0x315,1},
	{"Защита по недогрузу",0.0, 0x030B,1},
	{"Время блокировки защиты по недогрузу",0.0, 0x030C,1},
	{"Время блокировки АПВ по недогрузу",0.0, 0x030D,1},
	{"Куст",0.0, 0x040D,1},
	{"Скважина",0.0, 0x040E,1},
	{"Пароль",0.0, 0x395,1},
	{"Служебный режим",0.0, 0x396,1},
	{"Шаг регистрации параметров",0.0, 0x342,1},
	{"Время (часы, минуты)",0.0,0x02FE,1},
	{"Дата (число, месяц)",0.0,0x02FC,1},
	{"Год",0.0, 0x02FD,1},
	{"Напряжение вторичной обмотки трансформатора",0.0, 0x301,1},
	{"Время блокировки запуска после включения питания",0.0, 0x337,1},
	{"Защита по Rиз",0.0, 0x328,1},
	{"Дисбаланс по U вх.   лин.",0.0, 0x325,1},
	{"Время срабатывания защиты по дисбалансу U вх.  лин.",0.0, 0x326,1},
	{"Время срабатывания защиты по дисбалансу I  вых. фаз",0.0, 0x318,1},
	{"Предельная температура ВД ",0.0, 0x35D,1},
	{"Давление жидкости на приеме насоса",0.0, 0x35A,1},
	{"Направление вращения",0.0, 0x3A0,1},
};
#define NUMBER_OF_SETTINGS_LUKOIL (sizeof(lukoil_Settings) / sizeof(setting_t))
#endif
