#ifndef _SETTINGS_LUKOIL_H_
#define _SETTINGS_LUKOIL_H_
static setting_t lukoil_Settings[] = {
	{31, "Частота вращения", 0.0, 0x039B, 1},
	{33, "Защита по перегрузу", 0.0, 0x311, 1},
	{34, "Время блокировки защиты по перегрузке", 0.0, 0x312, 1},
	{35, "Время блокировки АПВ по перегрузке", 0.0, 0x313, 1},
	{36, "Количество перезапусков", 0.0, 0x314, 1},
	{37, "Время,  в течение которого разрешены перезапуски", 0.0, 0x315, 1},
	{39, "Защита по недогрузу", 0.0, 0x030B, 1},
	{40, "Время блокировки защиты по недогрузу", 0.0, 0x030C, 1},
	{41, "Время блокировки АПВ по недогрузу", 0.0, 0x030D, 1},
	{42, "Куст", 0.0, 0x040D, 1},
	{43, "Скважина", 0.0, 0x040E, 1},
	{44, "Пароль", 0.0, 0x395, 1},
	{45, "Служебный режим", 0.0, 0x396, 1},
	{48, "Шаг регистрации параметров", 0.0, 0x342, 1},
	{49, "Время (часы, минуты)", 0.0, 0x02FE, 1},
	{50, "Дата (число, месяц)", 0.0, 0x02FC, 1},
	{51, "Год", 0.0, 0x02FD, 1},
	{52, "Напряжение вторичной обмотки трансформатора", 0.0, 0x301, 1},
	{53, "Время блокировки запуска после включения питания", 0.0, 0x337, 1},
	{54, "Защита по Rиз", 0.0, 0x328, 1},
	{55, "Дисбаланс по U вх.   лин.", 0.0, 0x325, 1},
	{56, "Время срабатывания защиты по дисбалансу U вх.  лин.", 0.0, 0x326, 1},
	{60, "Время срабатывания защиты по дисбалансу I  вых. фаз", 0.0, 0x318, 1},
	{63, "Предельная температура ВД ", 0.0, 0x35D, 1},
	{64, "Давление жидкости на приеме насоса", 0.0, 0x35A, 1},
	{67, "Направление вращения", 0.0, 0x3A0, 1},
};
#define NUMBER_OF_SETTINGS_LUKOIL (sizeof(lukoil_Settings) / sizeof(setting_t))
#endif
