#ifndef _SETTINGS_TNKBP_H_
#define _SETTINGS_TNKBP_H_
static setting_m_t tnkbp_Settings[] = {
	{31, "Частота вращения", 0.0, 0x257, 1},
	{33, "Защита по перегрузу", 0.0, 0x232, 1},
	{34, "Время блокировки защиты по перегрузке", 0.0, 0x233, 1},
	{35, "Время блокировки АПВ по перегрузке", 0.0, 0x235, 1},
	{36, "Количество перезапусков", 0.0, 0x251, 1},
	{37, "Время,  в течение которого разрешены перезапуски",0.0,0x234,1},
	{39, "Защита по недогрузу", 0.0, 0x237, 1},
	{40, "Время блокировки защиты по недогрузу", 0.0, 0x238, 1},
	{41, "Время блокировки АПВ по недогрузу", 0.0, 0x23A, 1},
	{42, "Куст", 0.0, 0x272, 1},
	{43, "Скважина", 0.0, 0x273, 1},
	{44, "Пароль", 0.0, 0x27D, 1},
	{45, "Служебный режим", 0.0, 0x27E, 1},
	{49, "Время (часы, минуты)",0.0,0x27C,1},
	{50, "Дата (число, месяц)",0.0,0x27B,1},
	{51, "Год", 0.0, 0x27A, 1},
	{52, "Напряжение вторичной обмотки трансформатора", 0.0, 0x230, 1},
	{53, "Время блокировки запуска после включения питания", 0.0, 0x22D, 1},
	{54, "Защита по Rиз", 0.0, 0x240, 1},
	{55, "Дисбаланс по U вх.   лин.", 0.0, 0x22A, 1},
	{56, "Время срабатывания защиты по дисбалансу U вх.  лин.", 0.0, 0x22B, 1},
	{59, "Дисбаланс по  I  вых. фаз.", 0.0, 0x23C, 1},
	{60, "Время срабатывания защиты по дисбалансу I  вых. фаз", 0.0, 0x23D, 1},
	{63, "Предельная температура ВД ", 0.0, 0x24B, 1},
	{64, "Давление жидкости на приеме насоса", 0.0, 0x247, 1},
};
#define NUMBER_OF_SETTINGS_TNKBP (sizeof(tnkbp_Settings) / sizeof(setting_m_t))
#endif
